Revit 2026 API

# RebarCrankTypeUtils Class

---

Utility class for dealing with Rebar Crank Type operations. To find all Rebar Crank Types in the document can be done using FilteredElementCollector of category BuiltInCategory.OST_RebarCrankType.

SystemObject Autodesk.Revit.DB.StructureRebarCrankTypeUtils

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RebarCrankTypeUtils
```
```vb
Public NotInheritable Class RebarCrankTypeUtils
```
```cpp
public ref class RebarCrankTypeUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarCrankTypeUtils = class end
```

The RebarCrankTypeUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateRebarCrankType | Creates a Rebar Crank Type element. |
|  | GetAllRebarCrankTypes | Gets all the Rebar Crank Types elements from the document. |
|  | GetCrankLengthMultiplier | Gets the crank length multiplier value. |
|  | GetCrankOffsetMultiplier | Gets the crank offset multiplier value. |
|  | GetCrankRatio | Gets the crank ratio value. |
|  | SetCrankLengthMultiplier | Sets the crank length multiplier value. |
|  | SetCrankOffsetMultiplier | Sets the crank offset multiplier value. |
|  | SetCrankRatio | Sets the crank ratio value. |

#### Reference

Autodesk.Revit.DB.Structure Namespace